
&НаСервере
Процедура PEN007_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	// Новые реквизиты формы
	НовыеРеквизиты = Новый Структура();
	НовыеРеквизиты.Вставить("РеквизитДата", ПФИ.ОписаниеТипаДатаВремя("Дата"));
	НовыеРеквизиты.Вставить("РеквизитЦвет", Новый ОписаниеТипов("Цвет"));
	ПФИ.СоздатьРеквизиты(ЭтотОбъект, НовыеРеквизиты);
	
	// Новая страница "Группа ПФИ" в группе страниц "Страницы"
	ГруппаСтраниц = ЭтотОбъект.Элементы.Страницы;
	ГруппаПФИ = ПФИ.СтраницаГруппыСтраниц(ЭтотОбъект, "ГруппаПФИ", ГруппаСтраниц, "Группа ПФИ", 1);
	
	// Новая декорация "Декорация Заголовок" в "Группе ПФИ". Дополнительно установлены Свойства ЦветТекста и ЦветФона
	ДекорацияЗаголовок = ПФИ.ДекорацияНадпись(ЭтотОбъект, "ДекорацияЗаголовок", ГруппаПФИ, "Пример использования библиотеки ПФИ");
	СвойстваЭлемента = Новый Структура();
	СвойстваЭлемента.Вставить("ЦветТекста", WebЦвета.Белый);
	СвойстваЭлемента.Вставить("ЦветФона", WebЦвета.СинеСерый);
	ПФИ.УстановитьСвойстваЭлементу(ДекорацияЗаголовок, СвойстваЭлемента);
	
	// Новая группа "ГруппаПоля" для поля ввода
	ГруппаПоля = ПФИ.ГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаПоля", ГруппаПФИ, 2);
	ПФИ.Поле(ЭтотОбъект, "ПолеДата", ГруппаПоля, "Поле дата", 1, "РеквизитДата");
	ПолеЦвет = ПФИ.Поле(ЭтотОбъект, "ПолеЦвет", ГруппаПоля, "Поле цвет", 1, "РеквизитЦвет");
	СобытияЭлемента = Новый Структура();
	СобытияЭлемента.Вставить("ПриИзменении", "ПолеЦветПриИзменении");
	СобытияЭлемента.Вставить("ОбработкаВыбора", "ПолеЦветОбработкаВыбора");
	ПФИ.УстановитьСобытияЭлементу(ПолеЦвет, СобытияЭлемента);

КонецПроцедуры

Процедура ПолеЦветПриИзменении(Элемент)
	ЭтотОбъект.Элементы.ДекорацияЗаголовок.ЦветФона = ЭтотОбъект.РеквизитЦвет;
КонецПроцедуры

Процедура ПолеЦветОбработкаВыбора(ВыбранноеЗначение, СтандартнаяОбработка)
	А = 1;
КонецПроцедуры